SPECIFIC_WEATHER_TEMPLATE: str = """
二、具体天气预报
1 月 17 日白天：多云为主，气温 8～16℃； 
1 月 17 日晚～19 日：受西南急流加强影响，转降雨天气， 
其中 18 日小到中雨，19 日中到大雨，气温 9～13℃；1 月 20～21 日白天：阴天多云为主，局地有短时阵雨， 
气温 7～10℃； 
1 月 21 日夜间～22 日：中层湿度增加，气温显著下降， 
自北向南将出现降雪天气，北部中到大雪，局部山区可出现暴 
雪，南部有小到中雪，积雪深度 1～3 厘米，局部可超过 5 厘 
米； 
1 月 23～24 日：转冷晴天气，大部分地区有冰冻和道路结 
冰，最低气温零下 5～零下 3℃，北部山区局地可低于零下 7℃； 
1 月 25～26 日：阴天多云，气温有所回升。
"""

SUGGEST_TEMPLATE: str = """
三、 关注与建议
1.**防范冷晴天气的不利影响。**有关部门需加强防范冷晴天气早晚低温及局部雾和霜冻 给水陆交通、高山景区旅游、农业生产 、 民众生活 等带来的不利影响 ；早晚气温持续偏低，电力、天然气等能源需求量将明显增大，建议做好能源储备和调度等工作；公众需注意预防流感、呼吸道与心脑血管等疾病；森林火险气象等级将升高，需继续做好防火工作。
2.**加强人工增雨作业。**蓄水不足的地区可在确保安全的前提下，抓住近期有利天气条件，适时开展生态型人工增雨作业，补充水资源。
3.**做好农业生产管理。**及时采收已成熟的柑橘，留树果实注意防冻，并做好支撑；加强油菜、蔬菜等在田作物水肥管理，培育壮苗越冬；提前检修加固作物大棚、禽畜圈舍等农业设施，做好保温防寒措施。
"""

SUMMARY_TEMPLATE: str = """
**摘要：**
预计受冷空气扩散南下影响，本周六（14日）全市转冷晴，至17日天气连晴，日最高气温回升至13～15℃。但早晚气温低，基本为0～3℃左右，其中最低气温出现在15日早晨，北部零下2℃～1℃，南部1～2℃，期间局部地区会出现雾或霜冻。18日开始新一轮冷空气影响，逐渐转阴天多云，局部有小雨，风力加大，19日最高气温下降明显，20日白天自西北向东南又转晴。
各地各部门需加强防范早晚低温及局部雾和霜冻 给水陆交通、高山景区旅游、农业生产 、 民众生活 等带来的不利影响。未来十天无有效降水， 森林火险气象等级将升高，需继续做好防火工作。 蓄水不足的地区可 在确保安全的前提下，抓住有利天气适时开展生态型人工增雨作业 。
"""